RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL36Z4/include/MKL36Z4_extension.h
/*! @brief Set the LCLK field to a new value. */
#define LCD_WR_GCR_LCLK(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCLK_MASK, LCD_GCR_LCLK(value)))
#define LCD_BWR_GCR_LCLK(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCLK_SHIFT), LCD_GCR_LCLK_SHIFT, LCD_GCR_LCLK_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field SOURCE[6] (RW)
 *
 * This bit is used to select which clock source is the basis for LCD clock. The
 * clock sources are chip-specific. For the clock source assignments, see the
 * chapter that describes how modules are configured. Alternate clock can be only
 * MCGIRCLK, and therefore when SOURCE=1, SIM_SOPT1[OSC32KSEL] bit plays no role.
 * Default clock can be either MCGIRCLK, ERCLK32K, OSC32KCLK, according to the
 * selection in SIM_SOPT1[OSC32KSEL].
 *
 * Values:
 * - 0b0 - Selects the default clock as the LCD clock source.
 * - 0b1 - Selects output of the alternate clock source selection (see
 *     ALTSOURCE) as the LCD clock source.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_SOURCE field. */
#define LCD_RD_GCR_SOURCE(base) ((LCD_GCR_REG(base) & LCD_GCR_SOURCE_MASK) >> LCD_GCR_SOURCE_SHIFT)
#define LCD_BRD_GCR_SOURCE(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_SOURCE_SHIFT, LCD_GCR_SOURCE_WIDTH))

/*! @brief Set the SOURCE field to a new value. */
#define LCD_WR_GCR_SOURCE(base, value) (LCD_RMW_GCR(base, LCD_GCR_SOURCE_MASK, LCD_GCR_SOURCE(value)))
#define LCD_BWR_GCR_SOURCE(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_SOURCE_SHIFT), LCD_GCR_SOURCE_SHIFT, LCD_GCR_SOURCE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDEN[7] (RW)
 *
 * Starts LCD controller waveform generator.
 *
 * Values:
 * - 0b0 - All front plane and back plane pins are disabled. The LCD controller
 *     system is also disabled, and all LCD waveform generation clocks are
 *     stopped. V LL3 is connected to V DD internally. All LCD pins, LCD_Pn, enabled
 *     using the LCD Pin Enable register, output a low value.
 * - 0b1 - LCD controller driver system is enabled, and front plane and back
 *     plane waveforms are generated. All LCD pins, LCD_Pn, enabled if PAD_SAFE is
 *     clearusing the LCD Pin Enable register, output an LCD driver waveform. The
 *     back plane pins output an LCD driver back plane waveform based on the
 *     settings of DUTY[2:0]. Charge pump or resistor bias is enabled.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDEN field. */
#define LCD_RD_GCR_LCDEN(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDEN_MASK) >> LCD_GCR_LCDEN_SHIFT)
#define LCD_BRD_GCR_LCDEN(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDEN_SHIFT, LCD_GCR_LCDEN_WIDTH))

/*! @brief Set the LCDEN field to a new value. */
#define LCD_WR_GCR_LCDEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDEN_MASK, LCD_GCR_LCDEN(value)))
#define LCD_BWR_GCR_LCDEN(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDEN_SHIFT), LCD_GCR_LCDEN_SHIFT, LCD_GCR_LCDEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDSTP[8] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Stop mode.
 *
 * Values:
 * - 0b0 - Allows the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator to continue running during Stop mode.
 * - 0b1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Stop mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDSTP field. */
#define LCD_RD_GCR_LCDSTP(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDSTP_MASK) >> LCD_GCR_LCDSTP_SHIFT)
#define LCD_BRD_GCR_LCDSTP(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDSTP_SHIFT, LCD_GCR_LCDSTP_WIDTH))

/*! @brief Set the LCDSTP field to a new value. */
#define LCD_WR_GCR_LCDSTP(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDSTP_MASK, LCD_GCR_LCDSTP(value)))
#define LCD_BWR_GCR_LCDSTP(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDSTP_SHIFT), LCD_GCR_LCDSTP_SHIFT, LCD_GCR_LCDSTP_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDDOZE[9] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Doze mode.
 *
 * Values:
 * - 0b0 - Allows the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator to continue running during Doze mode.
 * - 0b1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Doze mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDDOZE field. */
#define LCD_RD_GCR_LCDDOZE(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDDOZE_MASK) >> LCD_GCR_LCDDOZE_SHIFT)
#define LCD_BRD_GCR_LCDDOZE(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDDOZE_SHIFT, LCD_GCR_LCDDOZE_WIDTH))

/*! @brief Set the LCDDOZE field to a new value. */
#define LCD_WR_GCR_LCDDOZE(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDDOZE_MASK, LCD_GCR_LCDDOZE(value)))
#define LCD_BWR_GCR_LCDDOZE(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDDOZE_SHIFT), LCD_GCR_LCDDOZE_SHIFT, LCD_GCR_LCDDOZE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field FFR[10] (RW)
 *
 * Increases the Frame Clock Frequency.
 *
 * Values:
 * - 0b0 - Standard Frame Rate LCD Frame Freq: 23.3 (min) 73.1 (max)
 * - 0b1 - Fast Frame Rate (Standard Frame Rate x2) LCD Frame Freq: 46.6 (min)
 *     146.2 (max)
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_FFR field. */
#define LCD_RD_GCR_FFR(base) ((LCD_GCR_REG(base) & LCD_GCR_FFR_MASK) >> LCD_GCR_FFR_SHIFT)
#define LCD_BRD_GCR_FFR(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_FFR_SHIFT, LCD_GCR_FFR_WIDTH))

/*! @brief Set the FFR field to a new value. */
#define LCD_WR_GCR_FFR(base, value) (LCD_RMW_GCR(base, LCD_GCR_FFR_MASK, LCD_GCR_FFR(value)))
#define LCD_BWR_GCR_FFR(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_FFR_SHIFT), LCD_GCR_FFR_SHIFT, LCD_GCR_FFR_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field ALTSOURCE[11] (RW)
 *
 * Values:
 * - 0b0 - Select Alternate Clock Source 1 (default)
 * - 0b1 - Select Alternate Clock Source 2
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_ALTSOURCE field. */
#define LCD_RD_GCR_ALTSOURCE(base) ((LCD_GCR_REG(base) & LCD_GCR_ALTSOURCE_MASK) >> LCD_GCR_ALTSOURCE_SHIFT)
#define LCD_BRD_GCR_ALTSOURCE(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_ALTSOURCE_SHIFT, LCD_GCR_ALTSOURCE_WIDTH))

/*! @brief Set the ALTSOURCE field to a new value. */
#define LCD_WR_GCR_ALTSOURCE(base, value) (LCD_RMW_GCR(base, LCD_GCR_ALTSOURCE_MASK, LCD_GCR_ALTSOURCE(value)))
#define LCD_BWR_GCR_ALTSOURCE(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_ALTSOURCE_SHIFT), LCD_GCR_ALTSOURCE_SHIFT, LCD_GCR_ALTSOURCE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field ALTDIV[13:12] (RW)
 *
 * Functions as a clock divider to divide the alternate clock before it is
 * selected as LCD clock source.
 *
 * Values:
 * - 0b00 - Divide factor = 1 (No divide)
 * - 0b01 - Divide factor = 8
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_ALTDIV field. */
#define LCD_RD_GCR_ALTDIV(base) ((LCD_GCR_REG(base) & LCD_GCR_ALTDIV_MASK) >> LCD_GCR_ALTDIV_SHIFT)
#define LCD_BRD_GCR_ALTDIV(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_ALTDIV_SHIFT, LCD_GCR_ALTDIV_WIDTH))

/*! @brief Set the ALTDIV field to a new value. */
#define LCD_WR_GCR_ALTDIV(base, value) (LCD_RMW_GCR(base, LCD_GCR_ALTDIV_MASK, LCD_GCR_ALTDIV(value)))
#define LCD_BWR_GCR_ALTDIV(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_ALTDIV_SHIFT), LCD_GCR_ALTDIV_SHIFT, LCD_GCR_ALTDIV_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field FDCIEN[14] (RW)
 *
 * Enables an LCD interrupt event when fault detection is completed.
 *
 * Values:
 * - 0b0 - No interrupt request is generated by this event.
 * - 0b1 - When a fault is detected and FDCF bit is set, this event causes an
 *     interrupt request.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_FDCIEN field. */
#define LCD_RD_GCR_FDCIEN(base) ((LCD_GCR_REG(base) & LCD_GCR_FDCIEN_MASK) >> LCD_GCR_FDCIEN_SHIFT)
#define LCD_BRD_GCR_FDCIEN(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_FDCIEN_SHIFT, LCD_GCR_FDCIEN_WIDTH))

/*! @brief Set the FDCIEN field to a new value. */
#define LCD_WR_GCR_FDCIEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_FDCIEN_MASK, LCD_GCR_FDCIEN(value)))
#define LCD_BWR_GCR_FDCIEN(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_FDCIEN_SHIFT), LCD_GCR_FDCIEN_SHIFT, LCD_GCR_FDCIEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field PADSAFE[15] (RW)
 *
 * Force safe state on LCD pad controls (all LCD frontplane and backplane
 * functions disabled) regardless of other LCD control bits.
 *
 * Values:
 * - 0b0 - LCD frontplane and backplane functions enabled according to other LCD
 *     control bits
 * - 0b1 - LCD frontplane and backplane functions disabled
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_PADSAFE field. */
#define LCD_RD_GCR_PADSAFE(base) ((LCD_GCR_REG(base) & LCD_GCR_PADSAFE_MASK) >> LCD_GCR_PADSAFE_SHIFT)
#define LCD_BRD_GCR_PADSAFE(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_PADSAFE_SHIFT, LCD_GCR_PADSAFE_WIDTH))

