RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL36Z4/include/MKL36Z4_extension.h
/*! @brief Set the BPCLCD27 field to a new value. */
#define LCD_WR_WF8B_BPCLCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD27_MASK, LCD_WF8B_BPCLCD27(value)))
#define LCD_BWR_WF8B_BPCLCD27(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD27_SHIFT), LCD_WF8B_BPCLCD27_SHIFT, LCD_WF8B_BPCLCD27_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD17[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD17 field. */
#define LCD_RD_WF8B_BPCLCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD17_MASK) >> LCD_WF8B_BPCLCD17_SHIFT)
#define LCD_BRD_WF8B_BPCLCD17(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD17_SHIFT, LCD_WF8B_BPCLCD17_WIDTH))

/*! @brief Set the BPCLCD17 field to a new value. */
#define LCD_WR_WF8B_BPCLCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD17_MASK, LCD_WF8B_BPCLCD17(value)))
#define LCD_BWR_WF8B_BPCLCD17(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD17_SHIFT), LCD_WF8B_BPCLCD17_SHIFT, LCD_WF8B_BPCLCD17_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD51[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD51 field. */
#define LCD_RD_WF8B_BPCLCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD51_MASK) >> LCD_WF8B_BPCLCD51_SHIFT)
#define LCD_BRD_WF8B_BPCLCD51(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD51_SHIFT, LCD_WF8B_BPCLCD51_WIDTH))

/*! @brief Set the BPCLCD51 field to a new value. */
#define LCD_WR_WF8B_BPCLCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD51_MASK, LCD_WF8B_BPCLCD51(value)))
#define LCD_BWR_WF8B_BPCLCD51(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD51_SHIFT), LCD_WF8B_BPCLCD51_SHIFT, LCD_WF8B_BPCLCD51_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD9[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD9 field. */
#define LCD_RD_WF8B_BPCLCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD9_MASK) >> LCD_WF8B_BPCLCD9_SHIFT)
#define LCD_BRD_WF8B_BPCLCD9(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD9_SHIFT, LCD_WF8B_BPCLCD9_WIDTH))

/*! @brief Set the BPCLCD9 field to a new value. */
#define LCD_WR_WF8B_BPCLCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD9_MASK, LCD_WF8B_BPCLCD9(value)))
#define LCD_BWR_WF8B_BPCLCD9(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD9_SHIFT), LCD_WF8B_BPCLCD9_SHIFT, LCD_WF8B_BPCLCD9_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD54[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD54 field. */
#define LCD_RD_WF8B_BPCLCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD54_MASK) >> LCD_WF8B_BPCLCD54_SHIFT)
#define LCD_BRD_WF8B_BPCLCD54(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD54_SHIFT, LCD_WF8B_BPCLCD54_WIDTH))

/*! @brief Set the BPCLCD54 field to a new value. */
#define LCD_WR_WF8B_BPCLCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD54_MASK, LCD_WF8B_BPCLCD54(value)))
#define LCD_BWR_WF8B_BPCLCD54(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD54_SHIFT), LCD_WF8B_BPCLCD54_SHIFT, LCD_WF8B_BPCLCD54_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD15[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD15 field. */
#define LCD_RD_WF8B_BPCLCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD15_MASK) >> LCD_WF8B_BPCLCD15_SHIFT)
#define LCD_BRD_WF8B_BPCLCD15(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD15_SHIFT, LCD_WF8B_BPCLCD15_WIDTH))

/*! @brief Set the BPCLCD15 field to a new value. */
#define LCD_WR_WF8B_BPCLCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD15_MASK, LCD_WF8B_BPCLCD15(value)))
#define LCD_BWR_WF8B_BPCLCD15(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD15_SHIFT), LCD_WF8B_BPCLCD15_SHIFT, LCD_WF8B_BPCLCD15_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD16[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD16 field. */
#define LCD_RD_WF8B_BPCLCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD16_MASK) >> LCD_WF8B_BPCLCD16_SHIFT)
#define LCD_BRD_WF8B_BPCLCD16(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD16_SHIFT, LCD_WF8B_BPCLCD16_WIDTH))

/*! @brief Set the BPCLCD16 field to a new value. */
#define LCD_WR_WF8B_BPCLCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD16_MASK, LCD_WF8B_BPCLCD16(value)))
#define LCD_BWR_WF8B_BPCLCD16(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD16_SHIFT), LCD_WF8B_BPCLCD16_SHIFT, LCD_WF8B_BPCLCD16_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD14[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD14 field. */
#define LCD_RD_WF8B_BPCLCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD14_MASK) >> LCD_WF8B_BPCLCD14_SHIFT)
#define LCD_BRD_WF8B_BPCLCD14(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD14_SHIFT, LCD_WF8B_BPCLCD14_WIDTH))

/*! @brief Set the BPCLCD14 field to a new value. */
#define LCD_WR_WF8B_BPCLCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD14_MASK, LCD_WF8B_BPCLCD14(value)))
#define LCD_BWR_WF8B_BPCLCD14(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD14_SHIFT), LCD_WF8B_BPCLCD14_SHIFT, LCD_WF8B_BPCLCD14_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD32[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD32 field. */
#define LCD_RD_WF8B_BPCLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD32_MASK) >> LCD_WF8B_BPCLCD32_SHIFT)
#define LCD_BRD_WF8B_BPCLCD32(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD32_SHIFT, LCD_WF8B_BPCLCD32_WIDTH))

