RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL36Z4/include/MKL36Z4_extension.h
/*! @brief Set the BPELCD57 field to a new value. */
#define LCD_WR_WF8B_BPELCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD57_MASK, LCD_WF8B_BPELCD57(value)))
#define LCD_BWR_WF8B_BPELCD57(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD57_SHIFT), LCD_WF8B_BPELCD57_SHIFT, LCD_WF8B_BPELCD57_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD52[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD52 field. */
#define LCD_RD_WF8B_BPELCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD52_MASK) >> LCD_WF8B_BPELCD52_SHIFT)
#define LCD_BRD_WF8B_BPELCD52(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD52_SHIFT, LCD_WF8B_BPELCD52_WIDTH))

/*! @brief Set the BPELCD52 field to a new value. */
#define LCD_WR_WF8B_BPELCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD52_MASK, LCD_WF8B_BPELCD52(value)))
#define LCD_BWR_WF8B_BPELCD52(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD52_SHIFT), LCD_WF8B_BPELCD52_SHIFT, LCD_WF8B_BPELCD52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD1[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD1 field. */
#define LCD_RD_WF8B_BPELCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD1_MASK) >> LCD_WF8B_BPELCD1_SHIFT)
#define LCD_BRD_WF8B_BPELCD1(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD1_SHIFT, LCD_WF8B_BPELCD1_WIDTH))

/*! @brief Set the BPELCD1 field to a new value. */
#define LCD_WR_WF8B_BPELCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD1_MASK, LCD_WF8B_BPELCD1(value)))
#define LCD_BWR_WF8B_BPELCD1(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD1_SHIFT), LCD_WF8B_BPELCD1_SHIFT, LCD_WF8B_BPELCD1_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD58[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD58 field. */
#define LCD_RD_WF8B_BPELCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD58_MASK) >> LCD_WF8B_BPELCD58_SHIFT)
#define LCD_BRD_WF8B_BPELCD58(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD58_SHIFT, LCD_WF8B_BPELCD58_WIDTH))

/*! @brief Set the BPELCD58 field to a new value. */
#define LCD_WR_WF8B_BPELCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD58_MASK, LCD_WF8B_BPELCD58(value)))
#define LCD_BWR_WF8B_BPELCD58(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD58_SHIFT), LCD_WF8B_BPELCD58_SHIFT, LCD_WF8B_BPELCD58_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD59[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD59 field. */
#define LCD_RD_WF8B_BPELCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD59_MASK) >> LCD_WF8B_BPELCD59_SHIFT)
#define LCD_BRD_WF8B_BPELCD59(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD59_SHIFT, LCD_WF8B_BPELCD59_WIDTH))

/*! @brief Set the BPELCD59 field to a new value. */
#define LCD_WR_WF8B_BPELCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD59_MASK, LCD_WF8B_BPELCD59(value)))
#define LCD_BWR_WF8B_BPELCD59(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD59_SHIFT), LCD_WF8B_BPELCD59_SHIFT, LCD_WF8B_BPELCD59_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD53[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD53 field. */
#define LCD_RD_WF8B_BPELCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD53_MASK) >> LCD_WF8B_BPELCD53_SHIFT)
#define LCD_BRD_WF8B_BPELCD53(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD53_SHIFT, LCD_WF8B_BPELCD53_WIDTH))

/*! @brief Set the BPELCD53 field to a new value. */
#define LCD_WR_WF8B_BPELCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD53_MASK, LCD_WF8B_BPELCD53(value)))
#define LCD_BWR_WF8B_BPELCD53(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD53_SHIFT), LCD_WF8B_BPELCD53_SHIFT, LCD_WF8B_BPELCD53_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD14[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD14 field. */
#define LCD_RD_WF8B_BPELCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD14_MASK) >> LCD_WF8B_BPELCD14_SHIFT)
#define LCD_BRD_WF8B_BPELCD14(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD14_SHIFT, LCD_WF8B_BPELCD14_WIDTH))

/*! @brief Set the BPELCD14 field to a new value. */
#define LCD_WR_WF8B_BPELCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD14_MASK, LCD_WF8B_BPELCD14(value)))
#define LCD_BWR_WF8B_BPELCD14(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD14_SHIFT), LCD_WF8B_BPELCD14_SHIFT, LCD_WF8B_BPELCD14_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD0[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD0 field. */
#define LCD_RD_WF8B_BPELCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD0_MASK) >> LCD_WF8B_BPELCD0_SHIFT)
#define LCD_BRD_WF8B_BPELCD0(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD0_SHIFT, LCD_WF8B_BPELCD0_WIDTH))

