RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL36Z4/include/MKL36Z4_extension.h
/*! @brief Set the BPGLCD24 field to a new value. */
#define LCD_WR_WF8B_BPGLCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD24_MASK, LCD_WF8B_BPGLCD24(value)))
#define LCD_BWR_WF8B_BPGLCD24(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD24_SHIFT), LCD_WF8B_BPGLCD24_SHIFT, LCD_WF8B_BPGLCD24_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD25[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD25 field. */
#define LCD_RD_WF8B_BPGLCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD25_MASK) >> LCD_WF8B_BPGLCD25_SHIFT)
#define LCD_BRD_WF8B_BPGLCD25(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD25_SHIFT, LCD_WF8B_BPGLCD25_WIDTH))

/*! @brief Set the BPGLCD25 field to a new value. */
#define LCD_WR_WF8B_BPGLCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD25_MASK, LCD_WF8B_BPGLCD25(value)))
#define LCD_BWR_WF8B_BPGLCD25(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD25_SHIFT), LCD_WF8B_BPGLCD25_SHIFT, LCD_WF8B_BPGLCD25_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD46[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD46 field. */
#define LCD_RD_WF8B_BPGLCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD46_MASK) >> LCD_WF8B_BPGLCD46_SHIFT)
#define LCD_BRD_WF8B_BPGLCD46(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD46_SHIFT, LCD_WF8B_BPGLCD46_WIDTH))

/*! @brief Set the BPGLCD46 field to a new value. */
#define LCD_WR_WF8B_BPGLCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD46_MASK, LCD_WF8B_BPGLCD46(value)))
#define LCD_BWR_WF8B_BPGLCD46(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD46_SHIFT), LCD_WF8B_BPGLCD46_SHIFT, LCD_WF8B_BPGLCD46_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD26[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD26 field. */
#define LCD_RD_WF8B_BPGLCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD26_MASK) >> LCD_WF8B_BPGLCD26_SHIFT)
#define LCD_BRD_WF8B_BPGLCD26(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD26_SHIFT, LCD_WF8B_BPGLCD26_WIDTH))

/*! @brief Set the BPGLCD26 field to a new value. */
#define LCD_WR_WF8B_BPGLCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD26_MASK, LCD_WF8B_BPGLCD26(value)))
#define LCD_BWR_WF8B_BPGLCD26(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD26_SHIFT), LCD_WF8B_BPGLCD26_SHIFT, LCD_WF8B_BPGLCD26_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD27[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD27 field. */
#define LCD_RD_WF8B_BPGLCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD27_MASK) >> LCD_WF8B_BPGLCD27_SHIFT)
#define LCD_BRD_WF8B_BPGLCD27(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD27_SHIFT, LCD_WF8B_BPGLCD27_WIDTH))

/*! @brief Set the BPGLCD27 field to a new value. */
#define LCD_WR_WF8B_BPGLCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD27_MASK, LCD_WF8B_BPGLCD27(value)))
#define LCD_BWR_WF8B_BPGLCD27(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD27_SHIFT), LCD_WF8B_BPGLCD27_SHIFT, LCD_WF8B_BPGLCD27_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD10[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD10 field. */
#define LCD_RD_WF8B_BPGLCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD10_MASK) >> LCD_WF8B_BPGLCD10_SHIFT)
#define LCD_BRD_WF8B_BPGLCD10(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD10_SHIFT, LCD_WF8B_BPGLCD10_WIDTH))

/*! @brief Set the BPGLCD10 field to a new value. */
#define LCD_WR_WF8B_BPGLCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD10_MASK, LCD_WF8B_BPGLCD10(value)))
#define LCD_BWR_WF8B_BPGLCD10(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD10_SHIFT), LCD_WF8B_BPGLCD10_SHIFT, LCD_WF8B_BPGLCD10_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD45[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD45 field. */
#define LCD_RD_WF8B_BPGLCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD45_MASK) >> LCD_WF8B_BPGLCD45_SHIFT)
#define LCD_BRD_WF8B_BPGLCD45(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD45_SHIFT, LCD_WF8B_BPGLCD45_WIDTH))

/*! @brief Set the BPGLCD45 field to a new value. */
#define LCD_WR_WF8B_BPGLCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD45_MASK, LCD_WF8B_BPGLCD45(value)))
#define LCD_BWR_WF8B_BPGLCD45(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD45_SHIFT), LCD_WF8B_BPGLCD45_SHIFT, LCD_WF8B_BPGLCD45_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD28[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD28 field. */
#define LCD_RD_WF8B_BPGLCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD28_MASK) >> LCD_WF8B_BPGLCD28_SHIFT)
#define LCD_BRD_WF8B_BPGLCD28(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD28_SHIFT, LCD_WF8B_BPGLCD28_WIDTH))

/*! @brief Set the BPGLCD28 field to a new value. */
#define LCD_WR_WF8B_BPGLCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD28_MASK, LCD_WF8B_BPGLCD28(value)))
#define LCD_BWR_WF8B_BPGLCD28(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD28_SHIFT), LCD_WF8B_BPGLCD28_SHIFT, LCD_WF8B_BPGLCD28_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD29[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD29 field. */
#define LCD_RD_WF8B_BPGLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD29_MASK) >> LCD_WF8B_BPGLCD29_SHIFT)
#define LCD_BRD_WF8B_BPGLCD29(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD29_SHIFT, LCD_WF8B_BPGLCD29_WIDTH))

/*! @brief Set the BPGLCD29 field to a new value. */
#define LCD_WR_WF8B_BPGLCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD29_MASK, LCD_WF8B_BPGLCD29(value)))
#define LCD_BWR_WF8B_BPGLCD29(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD29_SHIFT), LCD_WF8B_BPGLCD29_SHIFT, LCD_WF8B_BPGLCD29_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD4[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD4 field. */
#define LCD_RD_WF8B_BPGLCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD4_MASK) >> LCD_WF8B_BPGLCD4_SHIFT)
#define LCD_BRD_WF8B_BPGLCD4(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD4_SHIFT, LCD_WF8B_BPGLCD4_WIDTH))

/*! @brief Set the BPGLCD4 field to a new value. */
#define LCD_WR_WF8B_BPGLCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD4_MASK, LCD_WF8B_BPGLCD4(value)))
#define LCD_BWR_WF8B_BPGLCD4(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD4_SHIFT), LCD_WF8B_BPGLCD4_SHIFT, LCD_WF8B_BPGLCD4_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD44[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD44 field. */
#define LCD_RD_WF8B_BPGLCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD44_MASK) >> LCD_WF8B_BPGLCD44_SHIFT)
#define LCD_BRD_WF8B_BPGLCD44(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD44_SHIFT, LCD_WF8B_BPGLCD44_WIDTH))

/*! @brief Set the BPGLCD44 field to a new value. */
#define LCD_WR_WF8B_BPGLCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD44_MASK, LCD_WF8B_BPGLCD44(value)))
#define LCD_BWR_WF8B_BPGLCD44(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD44_SHIFT), LCD_WF8B_BPGLCD44_SHIFT, LCD_WF8B_BPGLCD44_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD30[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD30 field. */
#define LCD_RD_WF8B_BPGLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD30_MASK) >> LCD_WF8B_BPGLCD30_SHIFT)
#define LCD_BRD_WF8B_BPGLCD30(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD30_SHIFT, LCD_WF8B_BPGLCD30_WIDTH))

/*! @brief Set the BPGLCD30 field to a new value. */
#define LCD_WR_WF8B_BPGLCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD30_MASK, LCD_WF8B_BPGLCD30(value)))
#define LCD_BWR_WF8B_BPGLCD30(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD30_SHIFT), LCD_WF8B_BPGLCD30_SHIFT, LCD_WF8B_BPGLCD30_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD2[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD2 field. */
#define LCD_RD_WF8B_BPGLCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD2_MASK) >> LCD_WF8B_BPGLCD2_SHIFT)
#define LCD_BRD_WF8B_BPGLCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD2_SHIFT, LCD_WF8B_BPGLCD2_WIDTH))

/*! @brief Set the BPGLCD2 field to a new value. */
#define LCD_WR_WF8B_BPGLCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD2_MASK, LCD_WF8B_BPGLCD2(value)))
#define LCD_BWR_WF8B_BPGLCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPGLCD2_SHIFT), LCD_WF8B_BPGLCD2_SHIFT, LCD_WF8B_BPGLCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD31[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD31 field. */
#define LCD_RD_WF8B_BPGLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD31_MASK) >> LCD_WF8B_BPGLCD31_SHIFT)
#define LCD_BRD_WF8B_BPGLCD31(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD31_SHIFT, LCD_WF8B_BPGLCD31_WIDTH))

