RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL36Z4/include/MKL36Z4_extension.h
/*! @brief Set the BPHLCD52 field to a new value. */
#define LCD_WR_WF8B_BPHLCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD52_MASK, LCD_WF8B_BPHLCD52(value)))
#define LCD_BWR_WF8B_BPHLCD52(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD52_SHIFT), LCD_WF8B_BPHLCD52_SHIFT, LCD_WF8B_BPHLCD52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD51[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD51 field. */
#define LCD_RD_WF8B_BPHLCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD51_MASK) >> LCD_WF8B_BPHLCD51_SHIFT)
#define LCD_BRD_WF8B_BPHLCD51(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD51_SHIFT, LCD_WF8B_BPHLCD51_WIDTH))

/*! @brief Set the BPHLCD51 field to a new value. */
#define LCD_WR_WF8B_BPHLCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD51_MASK, LCD_WF8B_BPHLCD51(value)))
#define LCD_BWR_WF8B_BPHLCD51(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD51_SHIFT), LCD_WF8B_BPHLCD51_SHIFT, LCD_WF8B_BPHLCD51_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD50[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD50 field. */
#define LCD_RD_WF8B_BPHLCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD50_MASK) >> LCD_WF8B_BPHLCD50_SHIFT)
#define LCD_BRD_WF8B_BPHLCD50(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD50_SHIFT, LCD_WF8B_BPHLCD50_WIDTH))

/*! @brief Set the BPHLCD50 field to a new value. */
#define LCD_WR_WF8B_BPHLCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD50_MASK, LCD_WF8B_BPHLCD50(value)))
#define LCD_BWR_WF8B_BPHLCD50(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD50_SHIFT), LCD_WF8B_BPHLCD50_SHIFT, LCD_WF8B_BPHLCD50_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD1[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD1 field. */
#define LCD_RD_WF8B_BPHLCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD1_MASK) >> LCD_WF8B_BPHLCD1_SHIFT)
#define LCD_BRD_WF8B_BPHLCD1(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD1_SHIFT, LCD_WF8B_BPHLCD1_WIDTH))

/*! @brief Set the BPHLCD1 field to a new value. */
#define LCD_WR_WF8B_BPHLCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD1_MASK, LCD_WF8B_BPHLCD1(value)))
#define LCD_BWR_WF8B_BPHLCD1(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD1_SHIFT), LCD_WF8B_BPHLCD1_SHIFT, LCD_WF8B_BPHLCD1_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD49[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD49 field. */
#define LCD_RD_WF8B_BPHLCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD49_MASK) >> LCD_WF8B_BPHLCD49_SHIFT)
#define LCD_BRD_WF8B_BPHLCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD49_SHIFT, LCD_WF8B_BPHLCD49_WIDTH))

/*! @brief Set the BPHLCD49 field to a new value. */
#define LCD_WR_WF8B_BPHLCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD49_MASK, LCD_WF8B_BPHLCD49(value)))
#define LCD_BWR_WF8B_BPHLCD49(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD49_SHIFT), LCD_WF8B_BPHLCD49_SHIFT, LCD_WF8B_BPHLCD49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD48[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD48 field. */
#define LCD_RD_WF8B_BPHLCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD48_MASK) >> LCD_WF8B_BPHLCD48_SHIFT)
#define LCD_BRD_WF8B_BPHLCD48(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD48_SHIFT, LCD_WF8B_BPHLCD48_WIDTH))

/*! @brief Set the BPHLCD48 field to a new value. */
#define LCD_WR_WF8B_BPHLCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD48_MASK, LCD_WF8B_BPHLCD48(value)))
#define LCD_BWR_WF8B_BPHLCD48(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD48_SHIFT), LCD_WF8B_BPHLCD48_SHIFT, LCD_WF8B_BPHLCD48_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD47[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD47 field. */
#define LCD_RD_WF8B_BPHLCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD47_MASK) >> LCD_WF8B_BPHLCD47_SHIFT)
#define LCD_BRD_WF8B_BPHLCD47(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD47_SHIFT, LCD_WF8B_BPHLCD47_WIDTH))

/*! @brief Set the BPHLCD47 field to a new value. */
#define LCD_WR_WF8B_BPHLCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD47_MASK, LCD_WF8B_BPHLCD47(value)))
#define LCD_BWR_WF8B_BPHLCD47(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD47_SHIFT), LCD_WF8B_BPHLCD47_SHIFT, LCD_WF8B_BPHLCD47_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD46[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD46 field. */
#define LCD_RD_WF8B_BPHLCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD46_MASK) >> LCD_WF8B_BPHLCD46_SHIFT)
#define LCD_BRD_WF8B_BPHLCD46(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD46_SHIFT, LCD_WF8B_BPHLCD46_WIDTH))

/*! @brief Set the BPHLCD46 field to a new value. */
#define LCD_WR_WF8B_BPHLCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD46_MASK, LCD_WF8B_BPHLCD46(value)))
#define LCD_BWR_WF8B_BPHLCD46(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD46_SHIFT), LCD_WF8B_BPHLCD46_SHIFT, LCD_WF8B_BPHLCD46_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD45[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD45 field. */
#define LCD_RD_WF8B_BPHLCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD45_MASK) >> LCD_WF8B_BPHLCD45_SHIFT)
#define LCD_BRD_WF8B_BPHLCD45(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD45_SHIFT, LCD_WF8B_BPHLCD45_WIDTH))

/*! @brief Set the BPHLCD45 field to a new value. */
#define LCD_WR_WF8B_BPHLCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD45_MASK, LCD_WF8B_BPHLCD45(value)))
#define LCD_BWR_WF8B_BPHLCD45(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD45_SHIFT), LCD_WF8B_BPHLCD45_SHIFT, LCD_WF8B_BPHLCD45_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD44[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD44 field. */
#define LCD_RD_WF8B_BPHLCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD44_MASK) >> LCD_WF8B_BPHLCD44_SHIFT)
#define LCD_BRD_WF8B_BPHLCD44(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD44_SHIFT, LCD_WF8B_BPHLCD44_WIDTH))

